package com.qianmua.constant;

/**
 * @author HJC
 * @version 1.0
 * 谦谦君子 卑以自牧也
 * @date 2020/12/11  16:59
 * @description :
 */
public interface RandomChickenSoup {

    public static final String[] CHICKEN_SOUP = new String[]{
      "希望是我们行走的灯光，一旦熄灭，天空就会灰暗，年轻就会失去意义，就难以寻找奋斗的方向。路在难走，总无绝路，只要灯光尚存，命运或许改变在下一个转角。捧着希望的灯光，我们能从地狱走向天堂。最难的日子里，相信还有明天，相信今天的炼狱，是为了明天的幸福更长远些。燃起那盏灯光，向前走吧。"
              ,"别人之所以放弃你，那就因为你已经先放弃了自己。相信只要你不放弃自己，没有哪个人会放弃你或者说没有哪个人能放弃你。相信自己是一个人战胜一切的力量之源，不相信自己的人没有成功的理由，因为一脚已跨到失败的坟墓中。"
              ,"不管多远的路，都能走到尽头；不论多深的痛苦，也会有结束的一天。背负明天的希望，在每一个痛并快乐的日子里，才能走得更加坚强；怀揣未来的梦想，在每一个平凡而不平淡的日子里，才会笑得更加灿烂。只要不放弃，就没有什么能让自己退缩；只要够坚强，就没有什么能把自己打垮！"
              ,"没有人让你烦恼，没有人让你痛苦。遇到事情，自己想不通，那是自己的智慧不够修行不够，自己应该要承担。你到任何场合去看，都不会有一切完美的。若是你只会以一种心态去面对，只会从一个角度去思考，那肯定有很多不完美不圆满的地方。"
              ,"成功来自于希望，成功来自于自信，成功来自于进取！让我们的生命在追寻梦想的精彩里生辉；让我们的生命在自信旺盛的奋进中充实；让我们的生命在进取博弈的努力中释放！你是最棒的！成功永远属于你！"
              ,"生活中，我们没有必要为难自己，质疑自己，有时，我们无法很好地理解或学会某样事物，那只是我们思考与接收问题的角度不同罢了。每个人都有自己的泪要擦，每个人都有自己的路要走，只要记得：冷了，给自己加件外衣；饿了，给自己买个面包；痛了，给自己一份坚强；失败了，给自己一个目标；跌倒了，在伤痛中爬起，给自己一个宽容的微笑继续往前走，已足够！"
              ,"生活不必非要完美…只要过的精彩。人牙齿是硬的，舌头是软的，到了人生的最后，牙齿都掉光了，舌头却不会掉，所以要柔软，人生才能长久，硬反而吃亏。心地柔软了，是修行最大的进步。一般形容执着的人说，你的心很硬，像钢铁一样。"
            ,"人都是有思想，有自尊的，尽管在地位财富容貌能力方面可能千差万别，但在精神上，只要他是一个心智健全的人，对别人的鄙夷和嘲笑是比较敏感的，任何一句不负责任的话语都有可能使他深受伤害，甚至毁了他的前程。所以，我们都要恪守为人最起码的原则：不要笑话别人。"
            ,"人生亦是如此，关键时刻如果一步走错，从此步步走错，想回头都不太可能。“一失足成千古恨，再回头已是百年身”这样的例子不胜枚举。要想赢得人生棋局，只有脚踏实地走好每一步，步步为营、稳扎稳打，方能走出无悔的人生之路。"
            ,"人生也像坐火车一样，过去的景色那样美，让你流连不舍，可是你总是需要前进，会离开，然后你告诉自己，没关系，我以后一定还会再来看，可其实，往往你再也不会回去。流逝的时间，退后的风景，邂逅的人，终究是渐行渐远。"
            ,"即使曾经再怎么滋生过爱的情愫，也没有人可以成为别人生命中屹立不倒且念念不忘的风景。回忆里的东西不再那么明媚，而且泛黄了许多，即使当初如何珍惜一个人，时光一过，也可能不会再那么想念。年光真是个好东西，可以冲淡一切，可以抹平一切。"
            ,"有人说：心有多大，舞台就有多大，没有做不到，只有想不到。只要我们想到了就要对自己说，我可以，我一定行。勇于面对自己的不足，超越自己的格局，承担失败，吸取纰漏，重头再来。如果你一败涂地，从此一蹶不振，那你只能望洋兴叹，遗憾终生。"
            ,"人生无处不是转弯的地方，只要我们还能走。幸运的是，我们能。即使前路艰险，孤身前行，也要坚定的相信。很多事也许结果并不像我们所期望的一样，但沿途的风景就已足够。记住青春时候的勇气，然后也更不在乎别人的否定。"
            ,"生活中的每一件事情都是有着基本规律的，就像成功的获得，从来都是来之不易的。爱因斯坦曾经说过：成功等于努力工作加懂得休息加少说废话，其实人生就是这样，每个人都在进步，你不奋勇争先，就要烂在社会最底层的淤泥里，没有人会为你的成长买单，逆水行舟，不进则退是社会永恒的法则。"
            ,"生命的天空里，有风和日丽，亦有云遮雾障。不是每轮艳阳都暖人，不是每片乌云都下雨。既然决定不了命运的走向，那就踏实走过每一天；既然左右不了天空的变幻，那就悉心装扮自己的心空。请相信：珍惜了，能拥有；付出了，有回报；走过了，不后悔。"
            ,"人生短短数载，或悲壮或欢喜；但挫折和磨难是必经之路，不过早晚而已。也许这些磨难是可以接受的，或许这些磨难，是无法承受的。但是，只要想活下去，就必须如同动物世界一样去战斗，否则就要放弃生存的权利。"
            ,

    };
}
