package com.qianmua.constant;

/**
 * @author HJC
 * @version 1.0
 * 谦谦君子 卑以自牧也
 * @date 2020/12/11  16:59
 * @description :
 */
public interface RandomChickenSoup {

    public static final String[] CHICKEN_SOUP = new String[]{
      "希望是我们行走的灯光，一旦熄灭，天空就会灰暗，年轻就会失去意义，就难以寻找奋斗的方向。路在难走，总无绝路，只要灯光尚存，命运或许改变在下一个转角。捧着希望的灯光，我们能从地狱走向天堂。最难的日子里，相信还有明天，相信今天的炼狱，是为了明天的幸福更长远些。燃起那盏灯光，向前走吧。"
              ,"别人之所以放弃你，那就因为你已经先放弃了自己。相信只要你不放弃自己，没有哪个人会放弃你或者说没有哪个人能放弃你。相信自己是一个人战胜一切的力量之源，不相信自己的人没有成功的理由，因为一脚已跨到失败的坟墓中。"
              ,"不管多远的路，都能走到尽头；不论多深的痛苦，也会有结束的一天。背负明天的希望，在每一个痛并快乐的日子里，才能走得更加坚强；怀揣未来的梦想，在每一个平凡而不平淡的日子里，才会笑得更加灿烂。只要不放弃，就没有什么能让自己退缩；只要够坚强，就没有什么能把自己打垮！"
              ,"没有人让你烦恼，没有人让你痛苦。遇到事情，自己想不通，那是自己的智慧不够修行不够，自己应该要承担。你到任何场合去看，都不会有一切完美的。若是你只会以一种心态去面对，只会从一个角度去思考，那肯定有很多不完美不圆满的地方。"
              ,"成功来自于希望，成功来自于自信，成功来自于进取！让我们的生命在追寻梦想的精彩里生辉；让我们的生命在自信旺盛的奋进中充实；让我们的生命在进取博弈的努力中释放！你是最棒的！成功永远属于你！"
              ,"生活中，我们没有必要为难自己，质疑自己，有时，我们无法很好地理解或学会某样事物，那只是我们思考与接收问题的角度不同罢了。每个人都有自己的泪要擦，每个人都有自己的路要走，只要记得：冷了，给自己加件外衣；饿了，给自己买个面包；痛了，给自己一份坚强；失败了，给自己一个目标；跌倒了，在伤痛中爬起，给自己一个宽容的微笑继续往前走，已足够！"
              ,"生活不必非要完美…只要过的精彩。人牙齿是硬的，舌头是软的，到了人生的最后，牙齿都掉光了，舌头却不会掉，所以要柔软，人生才能长久，硬反而吃亏。心地柔软了，是修行最大的进步。一般形容执着的人说，你的心很硬，像钢铁一样。"
            ,"人都是有思想，有自尊的，尽管在地位财富容貌能力方面可能千差万别，但在精神上，只要他是一个心智健全的人，对别人的鄙夷和嘲笑是比较敏感的，任何一句不负责任的话语都有可能使他深受伤害，甚至毁了他的前程。所以，我们都要恪守为人最起码的原则：不要笑话别人。"
            ,"人生亦是如此，关键时刻如果一步走错，从此步步走错，想回头都不太可能。“一失足成千古恨，再回头已是百年身”这样的例子不胜枚举。要想赢得人生棋局，只有脚踏实地走好每一步，步步为营、稳扎稳打，方能走出无悔的人生之路。"
            ,"人生也像坐火车一样，过去的景色那样美，让你流连不舍，可是你总是需要前进，会离开，然后你告诉自己，没关系，我以后一定还会再来看，可其实，往往你再也不会回去。流逝的时间，退后的风景，邂逅的人，终究是渐行渐远。"
            ,"即使曾经再怎么滋生过爱的情愫，也没有人可以成为别人生命中屹立不倒且念念不忘的风景。回忆里的东西不再那么明媚，而且泛黄了许多，即使当初如何珍惜一个人，时光一过，也可能不会再那么想念。年光真是个好东西，可以冲淡一切，可以抹平一切。"
            ,"有人说：心有多大，舞台就有多大，没有做不到，只有想不到。只要我们想到了就要对自己说，我可以，我一定行。勇于面对自己的不足，超越自己的格局，承担失败，吸取纰漏，重头再来。如果你一败涂地，从此一蹶不振，那你只能望洋兴叹，遗憾终生。"
            ,"人生无处不是转弯的地方，只要我们还能走。幸运的是，我们能。即使前路艰险，孤身前行，也要坚定的相信。很多事也许结果并不像我们所期望的一样，但沿途的风景就已足够。记住青春时候的勇气，然后也更不在乎别人的否定。"
            ,"生活中的每一件事情都是有着基本规律的，就像成功的获得，从来都是来之不易的。爱因斯坦曾经说过：成功等于努力工作加懂得休息加少说废话，其实人生就是这样，每个人都在进步，你不奋勇争先，就要烂在社会最底层的淤泥里，没有人会为你的成长买单，逆水行舟，不进则退是社会永恒的法则。"
            ,"生命的天空里，有风和日丽，亦有云遮雾障。不是每轮艳阳都暖人，不是每片乌云都下雨。既然决定不了命运的走向，那就踏实走过每一天；既然左右不了天空的变幻，那就悉心装扮自己的心空。请相信：珍惜了，能拥有；付出了，有回报；走过了，不后悔。"
            ,"人生短短数载，或悲壮或欢喜；但挫折和磨难是必经之路，不过早晚而已。也许这些磨难是可以接受的，或许这些磨难，是无法承受的。但是，只要想活下去，就必须如同动物世界一样去战斗，否则就要放弃生存的权利。"
            ,"人生是一段旅程，走过的路，就是你编织的生活，我们无法预知以后的路途，但是，我们能把握现在的自己，珍惜身边的一切，脚踏实地的走，走好自己的路，不要在生命里给自己留下遗憾的风景。生活一直都很简单，但是我们也一直都忍不住要把它变得很复杂。"
            ,"许多在眼前看来天大的事，都不是人生一战，而只是人生一站。我知道高考让你们很辛苦，坚持了这么久，就已经是胜利。漫长的夏天和宽广的人生还在等着你们，迈过去，你们就会看到梦想，一直在路上，不曾远离。"
            ,"工作不论好坏，关键在于你以怎样的态度去面对。你可以是个卖水的，但你可以选择做到娃哈哈那样；你可以是个卖盒饭的，但你可以选择做到麦当劳那样；你可以是个卖米的，但你可以选择做到像王永庆那样，这就是穷人与富人的区别。"
            ,"你现在正在享受的正在体会的，才是你真正拥有的。你名义上的财富地位乃至感情再多，如果不能真实体会和品味，也等同于没有。所以，珍惜遇到的每一个善缘，真实地体会她：一缕清风，一个微笑，一只飞过眼前的小鸟，一间整洁的旅馆的房间，一丝若有若无的花香。"
            ,"请做一个善良的人，把爱给身边所有的人，你不知道什么时候他们中的某一个就会离你而去，不会再见，请让他们在生命的旅途中能够多享受一份爱的美好。成功与安逸是不可兼得的，选择了其一，就必定放弃了另一结局。今天不努力，明天必定遭罪。"
            ,"生命需要奋斗，奋斗与不奋斗，造就的结果截然不同。生无所息，保持奋斗的姿态，让世界变得如此灿烂，让你的人生绚烂多姿。千万不能满足小溪的平缓，否则你也就满足了自己的平庸，只有欣赏到山峰的险峻，才有机会欣赏自己。"
            ,"人应该找准自己的位置。否则，就象一只风浪中飘泊不定的船，在对一些重大的事情做出决定时，连方向都把握不住，任何理想抱负都是空谈。信心来自于你对生活的真诚回报，一些浮躁和虚无的夸夸其谈是禁不住生命的考验的。"
            ,"人生是复杂的，有太多理不清的思绪；人生是虚幻的，有太多的美妙的幻想；人生是凄美的，有说不尽、讲不完的壮丽；人生是幸福的，有享受不尽的爱的轻抚。人生犹如一个百味瓶，任你怎么闻辨终不知其味。纷繁复杂的气味混杂一起让我们难以澄清难以解释，这就是人生。"
            ,"不经意间一天复一天、一年复一年，岁月虽一分一秒都不会停歇，对于人生的路途，我们有太多的憧憬与展望。每个人都希冀自己的人生是辉煌伟业的，每个人都想做一个成功人士，但对于实现理想谈何容易，不是一天两天就能完成的，有可能很多人一生都难以实现理想。"
            ,"漫漫人生路，何时是尽头？人生路上谁与我做伴、谁与我鼓励、谁与我喝彩，只有我为自己加油喝彩！当一个人，看清自己人生的航行路线，是多么迂回多么曲折，要依靠自己的良心作为领航员，只有去追求完美，才会珍惜有限年华；才会更加热爱生活；才会深深地眷恋这个世界。"
            ,"绝境不仅仅是一段距离一个门槛和一次洗礼，同样也是一次转折一次醒悟和升华。在绝境中你会突破生命的樊篱，超越与俗人甚至包括你自己所见不同的常规，书写连你自己都不曾想过的神话。所以，绝境才是你的资本你的证明。"
            ,"梦想似乎是遥远的，但是只要通过自己的努力，就能一步步的拉近之间的距离，当距离越来越短时，它就不再是梦，而成为了触手可及的想法，无论如何，不要停下走向梦想的脚步。"
            ,"总是活在过去的人，生活是糟糕的，思想是糟糕的，人生也是糟糕的，因为他一直在逃避。记忆是用来怀念的，不是拿来祭奠的，也不是拿来作为你逃避的工具的。真正懂得生活的人，只会怀念往昔，绝不会拿往昔来填充现在。"
            ,"这世界，比你不幸的人远远多过比你幸运的人，路要一步步走，虽然到达终点的那一步很激动人心，但大部分的脚步是平凡甚至枯燥的，但没有这些脚步，或者耐不住这些平凡枯燥，你终归是无法迎来最后的那些激动人心。"
            ,"心有多宽，人生的舞台就有多宽，如果不能打碎心中的壁垒，即使给你整个世界，你也找不到自由的感觉。人生的坚持，就是学习的坚持，尽管是遭遇困苦，但是我们却是能在一次次的苦难中去成长，重新的去爬起来。这就是奋斗的人生。"
            ,"许多人喜欢设立小的目标，因为他们害怕失败。实际上，他们害怕的却是意识到他们有能力去做很多事情，而他们却浪费了这些时间和梦想。你是有能力去做每一个你想做到的事情的。不要再设立小小的目标，而在今天把眼光放的更远大一些吧。这是你欠自己的一个目标！"
            ,"掌声是一道彩虹，绚烂的色彩是赞许；掌声是一颗珍珠，晶莹的光芒的欣赏；掌声是一朵鲜花，美丽的纹面是肯定。当彩虹升起，当珍珠闪光，当鲜花绽放，在响亮的掌声中我心海激荡。在人生的道路上，总会遇到波澜起伏的事情。关键是你心中的信心是否残存，而掌声正是信心来源之一。"
            ,"人生的路上，谁的生活都不可能一成不变，所以不要笑话别人，说不定有一天被你笑话的人正是能帮到你的人！做人要给自己留条路，那就是后路，谁也不会完美无缺，谁也不敢保证自己一直都是人生得意的。不要把别人的不好当做是你的笑柄！"
            ,"不要让心太累，不要追想太多已经不属于自己的人和事。你我所走过的每一个地方，每一个人，也许都将成为驿站成为过客。一向喜欢追忆，喜欢回顾，喜欢不忘记，如今却发现，深刻在心里的那些东西，早已在他们的时间里化成遗忘。"
            ,"人生的狂热是因为梦想的萌芽而日渐蓬勃人生的**，是因为梦想的延续而茁壮成长。它让我们熔铸着骆驼越漠的坚韧，梦想之灯照亮我们依旧迷茫的方向，没有梦想的人生如同没有星光的夜空让人们不再仰望，没有梦想的人生如同没有曙光的黎明让人们不再追逐。"

    };
}
